MARCUS MATHURAM

Madurai, India 625020
+91 9688597790
marcus.mathuram7@gmail.com
WWW: https://marcusmathuram-portfolio.netlify.app/

Websites, Portfolios, Profiles

https://github.com/MarcusMathuram46
https://www.linkedin.com/in/marcus-mathuram46/

Professional Summary

Experienced software development professional with expertise in web application development and design. Proficient in HTML, CSS, JavaScript, React JS, Node Js, Express Js, and MongoDb. Demonstrated ability in developing and deploying complex backend systems, web services, and databases. Committed to delivering high-quality solutions that meet client needs and enhance user experiences.

Skills

HTML

CSS

Bootstrap

React Js

Express Js

JavaScript

Mongo DB

Node Js

C

Full-stack development

Security best practices

Performance optimization

Version control

Responsive web design

Work History

GUVI GEEK NETWORK PRIVATE LIMITED - Chennai, India
MERN STACK DEVELOPER    

Company Overview: Proficient in MongoDB, Express Js, React Js, and Node Js (MERN) stack showcased through hands-on projects
Applied MERN stack knowledge to develop dynamic and responsive web applications
Demonstrated effective problem-solving skills in addressing development challenges
Equipped with industry-relevant skills, poised to contribute to dynamic development teams with a focus on collaborative success
Proficient in MongoDB, Express Js, React Js, and Node Js (MERN) stack showcased through hands-on projects

January 2024 - Current

Elshaddai IT Development and Solutions - Madurai, India
MERN Full Stack Developer    

Reviewed code, debugged problems, and corrected issues.
Inspected equipment, assessed functionality, and optimized controls.
Discussed project progress with customers, collected feedback on different stages and directly addressed concerns.
used React Js, Bootstrap,Framer-Motion for designing FrontEnd.
Used Node Js,Express Js,MongoDb to develop and manage databases.

Education

January 2022
JEPPIAAR ENGINEERING COLLEGE 
Bachelor of Engineering 
GPA: CGPA : 8.0

January 2018
MAHATMA MATRIC HIGHER SEC SCHOOL 
HSC 
GPA: 70%

January 2018
MAHATMA MATRIC HIGHER SEC SCHOOL 
SSLC 
GPA: 89%

Project

Dynamic Portfolio, Dynamic portfolio showcasing my skills, education, and professional experience. Highlights include notable projects, technical proficiency, and academic achievements. The export PDF function ensures easy sharing of a polished and comprehensive resume. URL Shortener, The hassle-free solution for turning long links into shareable, concise URLs. Streamline your online communication with our user-friendly interface and benefit from detailed link analytics. Login Authentication Rest Countries Flags Weather API Rest Countries Flags Price/Shopping Cart My TODO List Dictionary Tic Tac Toe Game

Projects

Ecommerce Application

Built a full-stack ecommerce platform with Redux for state management.
Notes Application

Developed a secure notes application with user authentication and CRUD functionality.
Resume Builder

Created a professional resume builder with customizable templates and styling options.
Chat Application

Designed a real-time chat application using Socket.IO with support for emojis and chat rooms.